{
  "irVersion": "1.0",
  "project": "omnivoice",
  "repository": "https://github.com/plexusone/omnivoice-core",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.14.0",
      "date": "2026-06-15",
      "highlights": [
        { "description": "Gateway provider registry for voice gateways (Twilio, Telnyx)" },
        { "description": "Realtime provider registry for native voice-to-voice (OpenAI Realtime, Gemini Live)" },
        { "description": "Side-effect registration via init() for provider discovery" }
      ],
      "added": [
        { "description": "`RegisterGatewayProvider()` for registering voice gateway providers", "commit": "609dc45" },
        { "description": "`GetGatewayProvider()` for retrieving registered gateway providers", "commit": "609dc45" },
        { "description": "`ListGatewayProviders()` for discovering available gateway providers", "commit": "609dc45" },
        { "description": "`HasGatewayProvider()` for checking gateway registration", "commit": "609dc45" },
        { "description": "`RegisterRealtimeProvider()` for registering native voice-to-voice providers", "commit": "609dc45" },
        { "description": "`GetRealtimeProvider()` for retrieving registered realtime providers", "commit": "609dc45" },
        { "description": "`ListRealtimeProviders()` for discovering available realtime providers", "commit": "609dc45" },
        { "description": "`HasRealtimeProvider()` for checking realtime registration", "commit": "609dc45" },
        { "description": "`registry.Gateway` interface for gateway provider implementations", "commit": "609dc45" },
        { "description": "`registry.RealtimeProvider` interface for realtime provider implementations", "commit": "609dc45" },
        { "description": "`registry.GatewayProviderFactory` and `registry.RealtimeProviderFactory` types", "commit": "609dc45" },
        { "description": "`WithListener()` option for pre-configured gateway listeners", "commit": "609dc45" },
        { "description": "`WithPublicURL()` option for gateway webhook callbacks", "commit": "609dc45" },
        { "description": "`WithListenAddr()` option for gateway server addresses", "commit": "609dc45" },
        { "description": "`WithConnectionID()` option for Telnyx connection IDs", "commit": "609dc45" },
        { "description": "`WithVoice()` option for realtime provider voice selection", "commit": "609dc45" },
        { "description": "`WithModel()` option for realtime provider model selection", "commit": "609dc45" },
        { "description": "`WithInstructions()` option for realtime provider system prompts", "commit": "609dc45" }
      ]
    },
    {
      "version": "v0.13.0",
      "date": "2026-06-15",
      "highlights": [
        { "description": "Typed Encoding system for audio format handling" },
        { "description": "Encoding normalization handles pcm16, ulaw, wav, and other aliases" },
        { "description": "IsRawEncoding() for detecting formats that need explicit parameters" }
      ],
      "added": [
        { "description": "`format.Encoding` type with constants: `Linear16`, `MuLaw`, `ALaw`, `MP3`, `Opus`, `FLAC`, `AAC`, `Speex`, `WebM`", "commit": "48d4fe4" },
        { "description": "`Encoding.Normalize()` method for canonical encoding names with alias mapping", "commit": "48d4fe4" },
        { "description": "`Encoding.IsRaw()` method to detect raw audio formats", "commit": "48d4fe4" },
        { "description": "`IsRawEncoding(string)` convenience function", "commit": "48d4fe4" },
        { "description": "WAV normalization to Linear16 (WAV is a container for raw PCM)", "commit": "5451f73" },
        { "description": "`Speex` and `WebM` encoding constants", "commit": "5451f73" }
      ],
      "changed": [
        { "description": "`audio/converter` uses `format.Encoding` type for codec selection", "commit": "48d4fe4" },
        { "description": "Predefined `AudioFormat` vars use encoding constants instead of strings", "commit": "48d4fe4" }
      ],
      "tests": [
        { "description": "Comprehensive tests for `Encoding.Normalize()` with all aliases", "commit": "48d4fe4" },
        { "description": "Tests for `IsRawEncoding()` with raw and container formats", "commit": "48d4fe4" }
      ]
    },
    {
      "version": "v0.12.1",
      "date": "2026-06-14",
      "highlights": [
        { "description": "Internal refactoring to reduce code duplication" },
        { "description": "Generic provider.Client[T] for multi-provider management" }
      ],
      "refactored": [
        { "description": "Extracted `provider.Client[T]` generic type for multi-provider management", "commit": "e93b9e1" },
        { "description": "`tts.Client` embeds `provider.Client[tts.Provider]`", "commit": "e93b9e1" },
        { "description": "`stt.Client` embeds `provider.Client[stt.Provider]`", "commit": "48cb1b3" },
        { "description": "`realtime.Client` embeds `provider.Client[realtime.Provider]`", "commit": "c249122" },
        { "description": "Removed duplicate `AudioFormat` from `realtime/provider.go`", "commit": "33b946a" }
      ],
      "added": [
        { "description": "`format.PCM16_24kHz` and `format.PCM16_16kHz` aliases for provider-agnostic usage", "commit": "33b946a" }
      ]
    },
    {
      "version": "v0.12.0",
      "date": "2026-06-14",
      "highlights": [
        { "description": "Realtime Provider interface for native voice-to-voice LLMs (OpenAI Realtime, Gemini Live)" },
        { "description": "Audio format conversion between telephony (mulaw 8kHz) and realtime providers (PCM16 16/24kHz)" },
        { "description": "RealtimeBridge for seamless telephony-to-realtime provider integration" },
        { "description": "Dual pipeline modes: text (STT→LLM→TTS) or realtime (voice-to-voice)" }
      ],
      "added": [
        { "description": "`realtime` package with `Provider` interface for voice-to-voice LLM providers", "commit": "55c873a" },
        { "description": "`ProcessConfig` with instructions, voice, functions, and callbacks", "commit": "55c873a" },
        { "description": "`AudioChunk` and `Transcript` types for provider output", "commit": "55c873a" },
        { "description": "`FunctionDeclaration` for model function calling", "commit": "55c873a" },
        { "description": "`Client` for multi-provider management with automatic fallback", "commit": "226915d" },
        { "description": "`audio/format` package with common audio format constants (Twilio, OpenAI, Gemini)", "commit": "4d1b2e2" },
        { "description": "`audio/converter` package for audio format conversion", "commit": "4e4d1b6" },
        { "description": "`TwilioToOpenAI()`, `OpenAIToTwilio()`, `TwilioToGemini()`, `GeminiToTwilio()` convenience functions", "commit": "4e4d1b6" },
        { "description": "`StreamConverter` for efficient streaming audio conversion", "commit": "4e4d1b6" },
        { "description": "`PipelineMode` type with `PipelineModeText` and `PipelineModeRealtime` constants", "commit": "235584e" },
        { "description": "`RealtimeConfig` for configuring realtime providers", "commit": "235584e" },
        { "description": "`RealtimeProviderFactory` interface for creating realtime providers from config", "commit": "235584e" },
        { "description": "`RealtimeBridge` for bridging telephony WebSocket to realtime providers", "commit": "df38137" },
        { "description": "`NewRealtimeBridgeForTwilio()` and `NewRealtimeBridgeForTwilioGemini()` convenience constructors", "commit": "df38137" }
      ],
      "tests": [
        { "description": "Unit tests for `realtime.Provider` interface and `Client`", "commit": "c009f3d" },
        { "description": "Tests for `audio/converter` with codec and sample rate conversion", "commit": "4e4d1b6" },
        { "description": "Tests for `RealtimeBridge` lifecycle and event handling", "commit": "df38137" }
      ]
    },
    {
      "version": "v0.11.0",
      "date": "2026-06-13",
      "highlights": [
        { "description": "Global provider registry with priority-based registration" },
        { "description": "Architecture documentation for provider implementation" }
      ],
      "added": [
        { "description": "Global `RegisterSTTProvider()`, `RegisterTTSProvider()`, `RegisterCallSystemProvider()` functions at package level", "commit": "49c11e3" },
        { "description": "`GetSTTProvider()`, `GetTTSProvider()`, `GetCallSystemProvider()` for retrieving registered providers", "commit": "49c11e3" },
        { "description": "`ListSTTProviders()`, `ListTTSProviders()`, `ListCallSystemProviders()` for discovering available providers", "commit": "49c11e3" },
        { "description": "`HasSTTProvider()`, `HasTTSProvider()`, `HasCallSystemProvider()` for checking registration", "commit": "49c11e3" },
        { "description": "`GetSTTProviderPriority()`, `GetTTSProviderPriority()`, `GetCallSystemProviderPriority()` for querying priority", "commit": "49c11e3" },
        { "description": "`PriorityThin` (0) and `PriorityThick` (10) constants for provider layering", "commit": "49c11e3" }
      ],
      "documentation": [
        { "description": "CLAUDE.md with provider registry architecture and implementation guidelines", "commit": "51f6883" },
        { "description": "Dependency architecture diagram (omnivoice-core → providers → omnivoice)", "commit": "51f6883" },
        { "description": "Step-by-step guide for adding new providers", "commit": "51f6883" }
      ]
    },
    {
      "version": "v0.10.0",
      "date": "2026-06-13",
      "highlights": [
        { "description": "Voice Gateway interface for provider-agnostic PSTN and WebRTC communication" },
        { "description": "Session persistence with in-memory and Redis backends" },
        { "description": "Barge-in detection for user interruption handling" }
      ],
      "added": [
        { "description": "`gateway` package with `Gateway` interface for PSTN telephony providers (Twilio, Telnyx, Vonage, Plivo)", "commit": "8f375df" },
        { "description": "`WebRTCGateway` interface for browser/mobile voice (LiveKit, Daily)", "commit": "8f375df" },
        { "description": "`Session` and `WebRTCSession` interfaces for active call management", "commit": "8f375df" },
        { "description": "Event types for call lifecycle: `SessionStarted`, `SessionEnded`, `UserSpeechStart`, `AgentSpeechStart`, `Interruption`, etc.", "commit": "8f375df" },
        { "description": "`storage` package with `SessionStore` interface for call state persistence", "commit": "b1c8cf9" },
        { "description": "`MemoryStore` for in-process session storage", "commit": "b1c8cf9" },
        { "description": "`RedisStore` for distributed session storage with configurable TTL", "commit": "b1c8cf9" },
        { "description": "`SessionState` type with conversation history, metrics, and recovery data", "commit": "b1c8cf9" },
        { "description": "`bargein` package with `Detector` for user interruption detection", "commit": "0ab0e4b" },
        { "description": "Interruption modes: `ModeImmediate`, `ModeAfterSentence`, `ModeDisabled`", "commit": "0ab0e4b" },
        { "description": "Automatic TTS cancellation on user speech detection", "commit": "0ab0e4b" },
        { "description": "`MulawToWAV()` function in `audio/codec` for WAV container encoding", "commit": "4a34433" }
      ],
      "documentation": [
        { "description": "Voice architecture guide with system design overview", "commit": "b2b6215" },
        { "description": "Barge-in detection usage guide", "commit": "b2b6215" },
        { "description": "Session storage configuration guide", "commit": "b2b6215" }
      ],
      "changed": [
        { "description": "Twilio example moved to `omni-twilio` repository", "commit": "26d2703" }
      ],
      "dependencies": [
        { "description": "Added `github.com/redis/go-redis/v9` for Redis session storage", "commit": "b1c8cf9" },
        { "description": "Bump `github.com/grokify/mogo` from 0.74.3 to 0.74.6", "commit": "e22b0e9" }
      ],
      "tests": [
        { "description": "Storage interface conformance tests for MemoryStore and RedisStore", "commit": "b1c8cf9" },
        { "description": "Barge-in detector tests for interruption modes and timing", "commit": "0ab0e4b" }
      ]
    },
    {
      "version": "v0.9.0",
      "date": "2026-05-02",
      "highlights": [
        { "description": "Canonical Transcript format for STT output with embedded JSON Schema" },
        { "description": "DurationMilliseconds type for JSON-friendly duration serialization" }
      ],
      "added": [
        { "description": "Canonical `Transcript` type in `stt` package for standardized STT output across providers", "commit": "af49b8b" },
        { "description": "`TranscriptSegment` and `TranscriptWord` types with timing information", "commit": "af49b8b" },
        { "description": "`TranscriptMetadata` for provenance (provider, model, options)", "commit": "af49b8b" },
        { "description": "`NewTranscript()` constructor from `TranscriptionResult`", "commit": "af49b8b" },
        { "description": "`LoadTranscript()` and `SaveJSON()` for file I/O", "commit": "af49b8b" },
        { "description": "`TotalDuration()`, `SegmentDuration()`, `WordDuration()` convenience methods", "commit": "af49b8b" },
        { "description": "`schema` package with embedded `TranscriptV1Schema` JSON Schema", "commit": "d794eb0" },
        { "description": "Duration fields use `duration.DurationMilliseconds` for integer millisecond JSON serialization", "commit": "af49b8b" }
      ],
      "tests": [
        { "description": "`TestNewTranscript` validates transcript creation from transcription results", "commit": "92755a8" },
        { "description": "`TestTranscriptJSONRoundTrip` validates JSON serialization and deserialization", "commit": "92755a8" }
      ],
      "dependencies": [
        { "description": "Added `github.com/grokify/mogo v0.74.3` for `DurationMilliseconds` type", "commit": "0f83fc8" }
      ]
    },
    {
      "version": "v0.8.0",
      "date": "2026-04-03",
      "highlights": [
        { "description": "New `resilience` package for provider-agnostic error classification and retry logic" },
        { "description": "Smart fallback in TTS and STT clients - only switch providers on permanent errors" },
        { "description": "8 error categories for actionable error handling decisions" }
      ],
      "added": [
        { "description": "`resilience` package with error categorization system", "commit": "53a72b1" },
        { "description": "`ErrorCategory` type with 8 categories: transient, rate_limit, validation, auth, not_found, server, quota, unknown", "commit": "53a72b1" },
        { "description": "`ErrorInfo` struct with category, retryability, code, message, suggestion, and retry-after hint", "commit": "53a72b1" },
        { "description": "`ProviderError` type wrapping provider errors with classification metadata", "commit": "53a72b1" },
        { "description": "`ErrorClassifier` interface for provider-specific error classification", "commit": "53a72b1" },
        { "description": "`HTTPStatusClassifier` for HTTP status code classification", "commit": "53a72b1" },
        { "description": "`Retry()` and `RetryWithResult[T]()` generic retry functions with configurable backoff", "commit": "53a72b1" },
        { "description": "`RetryConfig` with max attempts, backoff strategy, classifier, and OnRetry callback", "commit": "53a72b1" },
        { "description": "`RetryError` type for exhausted retry attempts with attempt count", "commit": "53a72b1" },
        { "description": "Backoff strategies: `ExponentialBackoff`, `LinearBackoff`, `ConstantBackoff`, `NoBackoff`", "commit": "53a72b1" },
        { "description": "`DefaultBackoff()` and `DefaultRetryConfig()` with sensible defaults", "commit": "53a72b1" },
        { "description": "`IsProviderError()` helper to extract `ProviderError` from error chain", "commit": "53a72b1" },
        { "description": "`IsRetryable()` helper to check error retryability", "commit": "53a72b1" }
      ],
      "changed": [
        { "description": "TTS client now uses smart fallback - only switches providers on permanent (non-retryable) errors", "commit": "53a72b1" },
        { "description": "STT client now uses smart fallback - only switches providers on permanent (non-retryable) errors", "commit": "53a72b1" },
        { "description": "Fallback behavior is now determined by error classification, not error occurrence", "commit": "53a72b1" }
      ],
      "documentation": [
        { "description": "Package documentation with examples in `resilience/doc.go`", "commit": "53a72b1" }
      ],
      "tests": [
        { "description": "44 tests in resilience package covering retry logic, backoff strategies, error types, and categories", "commit": "53a72b1" },
        { "description": "4 TTS fallback behavior tests in `tts/fallback_test.go`", "commit": "53a72b1" },
        { "description": "4 STT fallback behavior tests in `stt/fallback_test.go`", "commit": "53a72b1" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-03-30",
      "highlights": [
        { "description": "Enhanced TTS mock fixtures with WAV audio generation" },
        { "description": "Provider-specific mocks for ElevenLabs, Deepgram, and OpenAI" },
        { "description": "Configurable mock behaviors for testing (latency, errors, timing)" }
      ],
      "added": [
        { "description": "`GenerateWAVFixture(durationMs, sampleRate)` creates valid WAV files with proper RIFF headers for testing", "commit": "17ef8b9" },
        { "description": "`GenerateShortWAV()` and `GenerateOneSecondWAV()` convenience fixtures", "commit": "17ef8b9" },
        { "description": "`MockProviderOption` functional options pattern for configurable mock behavior", "commit": "17ef8b9" },
        { "description": "`WithFixedDuration(ms)` option for mocks returning fixed-length audio", "commit": "17ef8b9" },
        { "description": "`WithRealisticTiming()` option for text-length-proportional audio duration", "commit": "17ef8b9" },
        { "description": "`WithError(err)` option for error injection testing", "commit": "17ef8b9" },
        { "description": "`WithLatency(duration)` option for simulating network delays", "commit": "17ef8b9" },
        { "description": "`WithFailAfterN(n, err)` option for testing retry/failover logic", "commit": "17ef8b9" },
        { "description": "`NewElevenLabsMock()` with 3 preconfigured voices (Rachel, Bella, Antoni)", "commit": "17ef8b9" },
        { "description": "`NewDeepgramMock()` with 3 preconfigured voices (Asteria, Luna, Orion)", "commit": "17ef8b9" },
        { "description": "`NewOpenAIMock()` with 6 preconfigured voices (Alloy, Echo, Fable, Onyx, Nova, Shimmer)", "commit": "17ef8b9" },
        { "description": "Common test errors: `ErrMockRateLimit`, `ErrMockQuotaExceeded`, `ErrMockNetworkError`, `ErrMockInvalidVoice`", "commit": "17ef8b9" }
      ],
      "tests": [
        { "description": "Comprehensive tests for WAV fixture generation and header validation", "commit": "17ef8b9" },
        { "description": "Tests for all MockProviderOption behaviors including context cancellation", "commit": "17ef8b9" },
        { "description": "Provider conformance tests for ElevenLabs, Deepgram, and OpenAI mocks", "commit": "17ef8b9" }
      ],
      "fixed": [
        { "description": "Fixed gofmt formatting and added G115 nolint annotations for bounded integer conversions in WAV generation", "commit": "aa28bc8" }
      ],
      "documentation": [
        { "description": "Testing with Mocks guide covering mock providers, WAV fixtures, and common test patterns", "commit": "1980a53" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-03-21",
      "highlights": [
        { "description": "Observability package for voice instrumentation with hooks and events" },
        { "description": "Registry package for provider discovery and registration" },
        { "description": "CallSystem client with multi-provider failover support" },
        { "description": "SMS messaging support via SMSProvider interface" }
      ],
      "added": [
        { "description": "`observability` package with VoiceEvent, VoiceObserver, TTSHook, and STTHook interfaces", "commit": "dda0212" },
        { "description": "Event types for call lifecycle (initiated, ringing, answered, ended, failed)", "commit": "dda0212" },
        { "description": "NoOpTTSHook and NoOpSTTHook for optional instrumentation", "commit": "dda0212" },
        { "description": "`registry` package with Registry interface for provider discovery", "commit": "0ec559f" },
        { "description": "Factory types for TTS, STT, and CallSystem providers", "commit": "0ec559f" },
        { "description": "`callsystem.Client` for managing multiple CallSystem providers with automatic failover", "commit": "c12a16a" },
        { "description": "`SMSProvider` interface and `SMSMessage` type for SMS support", "commit": "d7d8c63" },
        { "description": "`Hook` field in `SynthesisConfig` for TTS observability", "commit": "8b3c38a" },
        { "description": "`Hook` field in `TranscriptionConfig` for STT observability", "commit": "8b3c38a" },
        { "description": "`Observer` field in `CallSystemConfig` and `CallOptions` for call events", "commit": "8b3c38a" },
        { "description": "`WithObserver` CallOption for per-call observability", "commit": "8b3c38a" },
        { "description": "`ObservableCallSystem` interface combining CallSystem with Observable", "commit": "8b3c38a" },
        { "description": "`SetHook()` and `Hook()` methods on TTS and STT clients", "commit": "8b3c38a" }
      ],
      "fixed": [
        { "description": "Resolved gosec G120 warnings in Twilio webhook example by adding http.MaxBytesReader", "commit": "ac115b7" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Go module path changed from `github.com/agentplexus/omnivoice` to `github.com/plexusone/omnivoice-core`", "commit": "bf46b07" }
      ]
    },
    {
      "version": "v0.4.3",
      "date": "2026-02-15",
      "highlights": [
        { "description": "Comprehensive tests for English and Chinese subtitle generation" }
      ],
      "tests": [
        { "description": "`TestWordsToSubtitleCues_EnglishWordGrouping` for word-based cue grouping", "commit": "0ddb8bc" },
        { "description": "`TestWordsToSubtitleCues_ChineseCharacters` for character-by-character tokenization", "commit": "0ddb8bc" },
        { "description": "`TestWordsToSubtitleCues_MixedChineseEnglish` for mixed language content", "commit": "0ddb8bc" },
        { "description": "`TestWordsToSubtitleCues_LongChineseText` for multi-cue splitting", "commit": "0ddb8bc" }
      ]
    },
    {
      "version": "v0.4.2",
      "date": "2026-02-15",
      "highlights": [
        { "description": "Fixed subtitle word cutoff at line boundaries" }
      ],
      "fixed": [
        { "description": "Subtitle cue chunking now checks actual wrapped line count instead of total character count, preventing words from being cut off when they would appear on a third line", "commit": "a301897" }
      ],
      "tests": [
        { "description": "`TestWordsToSubtitleCues_LineCountLimit` verifies cues split correctly at line boundaries", "commit": "a301897" }
      ]
    },
    {
      "version": "v0.4.1",
      "date": "2026-02-14",
      "highlights": [
        { "description": "STT conformance tests for `TranscribeFile` and `TranscribeURL` batch transcription methods" }
      ],
      "tests": [
        { "description": "`TranscribeFile` conformance test for local file transcription", "commit": "c441944" },
        { "description": "`TranscribeURL` conformance test for remote URL transcription", "commit": "c441944" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Subtitle generation from STT transcription results" },
        { "description": "Extensible config maps for provider-specific settings" }
      ],
      "added": [
        { "description": "Subtitle package for SRT/VTT generation from transcription results", "commit": "17730a7" },
        { "description": "Configurable max characters per line and lines per cue for subtitles", "commit": "17730a7" },
        { "description": "Word-level timestamp-based cue splitting", "commit": "17730a7" },
        { "description": "`Extensions` map in `TranscriptionConfig` for provider-specific STT settings", "commit": "84c37f5" },
        { "description": "`Extensions` map in `SynthesisConfig` for provider-specific TTS settings", "commit": "665c3be" }
      ],
      "tests": [
        { "description": "Call system provider conformance tests (`MakeCall`, `ListCalls`, `OnIncomingCall`)", "commit": "9683ca2" },
        { "description": "Transport provider conformance tests (`Listen`, `Connect`, `Protocol`)", "commit": "9683ca2" }
      ],
      "fixed": [
        { "description": "Subtitle `wrapText` no longer clips words when text exceeds line limit", "commit": "63144bb" }
      ],
      "documentation": [
        { "description": "Voice cloning guide with recording tips and phonetically balanced text", "commit": "1f0cdd8" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Provider conformance test suites for TTS and STT implementations" }
      ],
      "added": [
        { "description": "TTS provider conformance test suite (`Synthesize`, `SynthesizeStream`, `SynthesizeFromReader`)", "commit": "e3705c7" },
        { "description": "Mock TTS provider for self-testing with configurable audio format responses", "commit": "e3705c7" },
        { "description": "STT provider conformance test suite (`Transcribe`, `TranscribeStream`)", "commit": "69cfd20" },
        { "description": "Mock STT provider with streaming transcription simulation", "commit": "69cfd20" }
      ],
      "fixed": [
        { "description": "MCP session and tool handlers now log `Close()` errors instead of discarding", "commit": "6099072" }
      ],
      "documentation": [
        { "description": "Provider conformance testing TRD describing test categories and API design", "commit": "58a9697" }
      ],
      "build": [
        { "description": "MIT LICENSE file", "commit": "f124dcf" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-18",
      "highlights": [
        { "description": "Audio codec package with PCM, mu-law, and a-law support for telephony" },
        { "description": "MCP server enabling Claude Code to make voice calls" },
        { "description": "Pipeline components connecting STT, TTS, and transport providers" }
      ],
      "added": [
        { "description": "Audio codec package with PCM sample conversions (int16, float32, float64, bytes)", "commit": "f64fe1e" },
        { "description": "Mu-law encoding/decoding for Twilio Media Streams", "commit": "f64fe1e" },
        { "description": "A-law encoding/decoding for international telephony", "commit": "f64fe1e" },
        { "description": "Audio resampling, normalization, and analysis utilities", "commit": "f64fe1e" },
        { "description": "MCP server with stdio transport for voice interactions", "commit": "721cbac" },
        { "description": "Voice interaction tools: `initiate_call`, `continue_call`, `speak_to_user`, `end_call`", "commit": "721cbac" },
        { "description": "Session management for tracking active voice calls", "commit": "721cbac" },
        { "description": "`TTSPipeline` for streaming TTS output to transport connections", "commit": "11c906d" },
        { "description": "`StreamingTTSPipeline` for connecting streaming LLM text to TTS to transport", "commit": "11c906d" },
        { "description": "`STTPipeline` for streaming audio from transport to STT with event callbacks", "commit": "11c906d" }
      ],
      "documentation": [
        { "description": "Voice integration PRD outlining goals, user stories, and success metrics", "commit": "fd86611" },
        { "description": "Twilio integration TRD detailing Media Streams architecture", "commit": "fd86611" }
      ],
      "tests": [
        { "description": "Comprehensive unit tests for audio codec functions (mu-law, a-law, PCM)", "commit": "f64fe1e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-28",
      "highlights": [
        { "description": "Initial OmniVoice voice abstraction layer for multi-provider telephony" }
      ],
      "added": [
        { "description": "Voice abstraction layer with provider-agnostic interfaces", "commit": "8a54bc2" },
        { "description": "STT (speech-to-text) provider interface with streaming support", "commit": "8a54bc2" },
        { "description": "TTS (text-to-speech) provider interface with streaming support", "commit": "8a54bc2" },
        { "description": "Transport interface for audio connections (Twilio, Zoom, etc.)", "commit": "8a54bc2" },
        { "description": "Export `CallOptions` for provider implementations", "commit": "7e1b52d" }
      ],
      "documentation": [
        { "description": "README with project overview and shields", "commit": "4f298df" },
        { "description": "Marp presentation for OmniVoice", "commit": "d2d67cf" }
      ],
      "build": [
        { "description": "GitHub Actions CI workflow", "commit": "4bad35d" },
        { "description": "golangci-lint configuration and fixes", "commit": "3693297" }
      ]
    }
  ]
}
